---
kind: other
id: Properties.T:Autodesk.Revit.DB.SolidGeometryOptions
source: html/57607bfb-fdcf-016c-ec96-79659dba2d55.htm
---
# SolidGeometryOptions Properties

Specifies whether the .NET object represents a valid Revit entity.